<?php
/**
 * FileName:property.php
 * Created by JellyChen
 * Date: 2018/2/25 下午4:05
 *
 * @author         JellyChen
 * @copyright      All Rights Reserved.
 * @version        1.0
 */

return [
    'has_payed'           => [
        0 => '未支付',
        1 => '已支付',
    ],
    'has_payed_select'    => [
        999 => '全部',
        0   => '未支付',
        1   => '已支付',
    ],
    'user_type'           => [
        1 => '普通会员',
        2 => '代理',
    ],
    'user_type_select'    => [
        999 => '全部',
        1   => '普通会员',
        2   => '代理',
    ],
    'order_type'          => [
        0 => '工具订单',
        1 => '组件订单',
        2 => '教程订单',
    ],
    'sex'                 => [
        0 => '未知',
        1 => '男',
        2 => '女',
    ],
    'element_type'        => [
        0 => '头像',
        1 => '工具',
        2 => '功能',
    ],
    'element_type_select' => [
        0   => '全部',
        999 => '头像',
        1   => '工具',
        2   => '功能',
    ],
    'is_free'             => [
        0 => '收费',
        1 => '免费',
    ],
    'code_level'          => [
        999 => '全部',
        1   => '一级',
        2   => '二级',
    ],
    'bind_select'         => [
        0 => '全部',
        1 => '未绑定',
        2 => '已绑定',
    ],
    'is_lock'             => [
        0 => '开放',
        1 => '锁定',
    ],
    'trans_status'        => [
        0 => '已删除',
        1 => '申请返现中',
        2 => '管理员已审批',
        3 => '返现成功',
        4 => '返现失败',
    ],
    'wechat_bank_code'    => [
        '1002' => '工商银行',
        '1005' => '农业银行',
        '1026' => '中国银行',
        '1003' => '建设银行',
        '1001' => '招商银行',
        '1066' => '邮储银行',
        '1020' => '交通银行',
        '1004' => '浦发银行',
        '1006' => '民生银行',
        '1009' => '兴业银行',
        '1010' => '平安银行',
        '1021' => '中信银行',
        '1025' => '华夏银行',
        '1027' => '广发银行',
        '1022' => '光大银行',
        '1032' => '北京银行',
        '1056' => '宁波银行',
    ],
];